var login;
var pass;

login = prompt('Кто стучится в дверь моя?', '');
debugger;/*
if ('Админ' === login) {

	pass = prompt('Введите секретный пук? O.o','');

	if ('Черный Властелин' === pass){
		alert('Черт побери ворвался как голые девки в Баню');
	}else if (null === pass) {
		alert('кажется вам не сюда... мб тогда по пивку?');
	}else {
		alert('Кто вы? Идите На..й! Я ВАС не знаю!');
	}

} else if (null === login){
	alert('кажется вам не сюда... мб тогда по пивку?');
} else{
	alert('Кто вы? Идите На..й! Я ВАС не знаю!');
}
*/
